def area(a, b):
	'''
		возвращает площадь прямоугольника, которя считается по формуле: S = a * b

		Пвраметры ввода:
			a (int) - длина прямоугольника
			b (int) - ширина прямоугольника

		Параметры вывода:
			area(a, b) (int): площадь прямоугольника со сторонами a и b
	'''
	return a * b


def perimeter(a, b):
	'''
		возвращает периметр прямоугольника, которя считается по формуле: P = 2*(a + b)

		Параметры ввода:
			a (int) - длина прямоугольника
			b (int) - ширина прямоугольника

		Параметры вывода:
			perimeter(a, b) (int): периметр прямоугольника со сторонами a и b
	'''
	return 2*(a + b)
